Revit 2027 API
TableCellCombinedParameterData.CategoryId Property
 Category id for this parameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId { get; set; }
Public Property CategoryId As ElementId
	Get
	Set
public:
property ElementId^ CategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CategoryId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace